W5D5/app/controllers/application_controller.rb

     def current_user #
          return nil unless session[:session_token] # what is going on
          User.find_by(session_token: session[:session_token]) # whats going on
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "fZ7V9Jidy1OQ+GQkRcslSw=="], ["LIMIT", 1]]