W5D5/app/controllers/users_controller.rb

    def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("password_digest", "session_token", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"