W5D5/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asdasdf@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email,password)
        user = User.find_by(email: email) # find user in the db based on their email

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "+jqPlwNGiCQC/ZQDoL7W+w=="], ["updated_at", "2019-06-21 20:29:38.251432"], ["id", 3]]
---
    def reset_session_token! #generates a new token if one doesnt exist?
        self.session_token = SecureRandom.base64(16)
        self.save!